import pandas as pd
import pymysql
import numpy

# 1. SELECT * FROM data;
data = {'id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10,11,12,13,14,15,16,17,18,19,20],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟','潘俊中','李国银','张运钦','蓝永钦','林明'],
'date':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24','1972/1/2','1966/3/4',
'1963/2/3','1969/7/19','1974/9/21']}
df = pd.DataFrame(data)
print(df)

# 2. SELECT * FROM data LIMIT(10);
df = pd.DataFrame(data)
filterData = df.head(10)
print(filterData)

# 3. SELECT id FROM data;  //id 是 data 表的特定一列
df = pd.DataFrame(data, columns=['id'])
print(df)

# 4. SELECT COUNT(id) FROM data;
df = pd.DataFrame(data, columns=['id'])
id_cnt = df.count()
print(id_cnt)

# 5. SELECT * FROM data WHERE id<1000 AND age>30;
data = {'id':[1, 10, 300, 400, 550, 688, 780, 940, 1001, 1111, 1203, 1309, 1503, 1665, 1890, 1992, 999, 2103, 2223, 3565],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟','潘俊中','李国银','张运钦','蓝永钦','林明'],
'date':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24','1972/1/2','1966/3/4',
'1963/2/3','1969/7/19','1974/9/21'],
'age':[22,24,23,44,32, 31,36,27,42,64, 32,19,26,22,26, 43,46,62,25,36]}
df = pd.DataFrame(data)
result = df.loc[ (df['id'] < 1000) & (df['age'] > 30) ]
print(result)

# 6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;
table1 = {'id':[1, 2, 3, 3, 5, 6, 6, 2, 9, 10,11,15,13,14,15,16,17,20,19,20],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟','潘俊中','李国银','张运钦','蓝永钦','林明'],
'date':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24','1972/1/2','1966/3/4',
'1963/2/3','1969/7/19','1974/9/21'],
'order_id':[22,24,23,23,32, 31,36,27,42,64, 32,19,26,22,26, 43,46,62,25,36]}
df = pd.DataFrame(table1)
result = df[['id','order_id']].groupby('id').aggregate({'order_id': pd.Series.nunique})
print(result)

# 7. SELECT * FROM table1 t1 INNER_JOIN table2 t2 ON t1.id = t2.id;
table1 = {'id':[1, 2, 3, 4, 5, 6, 10,11,14,15,16,17,18,19,20],
'date':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24']}
df1 = pd.DataFrame(table1)
table2 = {'id':[1, 4, 5, 6, 7, 8, 9, 11,12,13,14,16,18,19,20],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟']}
df2 = pd.DataFrame(table2)
result = pd.merge(df1, df2, on='id', how='inner')
print(result)

# 8. SELECT * FROM table1 UNION SELECT * FROM table2;
table1 = {'id':[1, 2, 3, 4, 5, 6, 10,11,14,15,16,17,18,19,20],
'content':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24']}
df1 = pd.DataFrame(table1)
table2 = {'id':[1, 4, 5, 6, 7, 8, 9, 11,12,13,14,16,18,19,20],
'content':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟']}
df2 = pd.DataFrame(table2)
result = pd.concat([df1, df2])
print(result)

# 9. DELETE FROM table1 WHERE id=10;
data = {'id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 11,12,13,14,15,16,17,10,18,19,20],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟','潘俊中','李国银','张运钦','蓝永钦','林明'],
'date':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24','1972/1/2','1966/3/4',
'1963/2/3','1969/7/19','1974/9/21']}
df = pd.DataFrame(data)
val_index = df.loc[df['id'] == 10].index
result = df.drop(index = val_index)
print(result)

# 10. ALTER TABLE table1 DROP COLUMN column_name;
table1 = {'id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 11,12,13,14,15,16,17,10,18,19,20],
'name':['易浩嵘','马志全','邝礼中','简应添','叶永锋','陈遇珍','刁元胜','冯建强','苏延伟','张双林',
    '李闪闪','夏勇军','林锦智','叶正雄', '曾祥伟','潘俊中','李国银','张运钦','蓝永钦','林明'],
'column_name':['1976/11/18','1974/1/14','1970/6/16','1966/8/10','1978/9/10','1963/8/17','1968/12/26','1983/5/11',
'1981/12/17','1966/5/3','1990/11/5','1969/8/18','1973/1/31','1975/2/20','1979/1/24','1972/1/2','1966/3/4',
'1963/2/3','1969/7/19','1974/9/21']}
df = pd.DataFrame(table1)
print(df)
result = df.drop(axis = 1, columns= 'column_name')
print(result)



